app/Http/Controllers/Web/AppointmentController.php

select * from `appointments` where `phone` = '0898445224' and `room_id` = '2' limit 1
---
    public function store(Request $request, Appointment $appointment)
    {
        //trùng sđt và căn hộ
        $currentAppointment = $this->appointment->where('phone',$request->phone)->where('room_id',$request->room_id)->first();