app/Http/Controllers/Web/HomeController.php

    public function index()
    {
        $rooms = $this->room->where('is_enabled', 1)->where('booked', 0)->get()->sortBy('price')->take(-3);
        $types = $this->type->all();
        $services = $this->service->where('is_enabled', 1)->get();
---
select * from `rooms` where `is_enabled` = 1 and `booked` = 0
select * from `types`
select * from `services` where `is_enabled` = 1