app/Http/Controllers/Web/RoomController.php

    public function show($id)
    {
        $room = $this->room->find($id);
        $availables = $this->room->limit(3)->get();
---
select * from `rooms` limit 3