app/Http/Controllers/Web/RoomController.php

    public function index()
    {
        $rooms = $this->room->where('is_enabled', '=', 1)->where('booked', 0)->get();
        $types = $this->type->all();
---
select * from `rooms` where `is_enabled` = 1 and `booked` = 0
select * from `types`

    public function show($id)
    {
        $room = $this->room->find($id);
        $availables = $this->room->where('is_enabled', '=', 1)->where('booked', 0)->limit(3)->get();
        $types = $this->type->all();
---
select * from `rooms` where `rooms`.`id` = '2' limit 1
select * from `rooms` where `is_enabled` = 1 and `booked` = 0 limit 3
select * from `types`