app/Models/Room.php

select * from `rooms` where `is_enabled` = 1 and `booked` = 0
---
    public function checkEmptyRoom(){
        $room = Room::where('is_enabled', 1)->where('booked', 0)->get();