app/Http/Controllers/Admin/AdminController.php

select * from `admins`
---
    public function index()
    {
        $admins = $this->admins->all();