app/Http/Controllers/Admin/AppointmentController.php

select * from `employees` where `personal_id` = '888899874' limit 1
select * from `appointments` where `employee_id` = 5
---
    public function index()
    {

        $this->checkAppointment();
        if (Auth::user()->role<>null){
            $employeeId = $this->employee->where('personal_id', Auth::user()->personal_id)->first()->id;
        }
        $appointments = Auth::user()->role<>null ? $this->appointment->where('employee_id', $employeeId)->get() : $this->appointment->all();

select * from `appointments`
---
    public function checkAppointment(){
        $appointments = Appointment::all();

select * from `rooms` where `is_enabled` = 1 and `booked` = 0
select * from `employees`
---
    public function create()
    {
        $checkEmptyRoom = $this->room->checkEmptyRoom();
        if(!$checkEmptyRoom){
            toastr()->error(trans('Đã hết Căn hộ trống'));
            return back();
        }
        $rooms = $this->room->where('is_enabled', 1)->where('booked', 0)->get();
        $employees = $this->employee->all();

select * from `appointments` where `appointments`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $appointment = $this->appointment->find($id);