app/Http/Controllers/Admin/BillController.php

    public function index($id)
    {
        $room = $this->room->find($id);
        $bookingOfRoom = $room->booking->id;
        $bills = $this->bill->where('booking_id', $bookingOfRoom)->get();
---
select * from `rooms` where `rooms`.`id` = '1' limit 1
select * from `bills` where `booking_id` = 1

    public function create($id)
    {
        $room = $this->room->find($id);
        $bookingOfRoom = $this->booking->where('room_id',$id)->first();
        $inDebt = $bookingOfRoom->paid == 0 ? $bookingOfRoom->total_price : 0;
        $bills = $this->bill->where('booking_id', $bookingOfRoom->id)->get();
        foreach ($bills as $bill){
            if($bill->status == 0){
                $inDebt += $bill->total;
            }
        }

        $services = $bookingOfRoom->services()->get();
---
select * from `rooms` where `rooms`.`id` = '3' limit 1
select * from `bookings` where `bookings`.`room_id` = 3 and `bookings`.`room_id` is not null limit 1
select * from `bills` where `booking_id` = 1
select * from `bookings` limit 1
select `services`.*, `booking_service`.`booking_id` as `pivot_booking_id`, `booking_service`.`service_id` as `pivot_service_id` from `services` inner join `booking_service` on `services`.`id` = `booking_service`.`service_id` where `booking_service`.`booking_id` = 1

    public function edit($id)
    {
        $bill= $this->bill->find($id);
---
select * from `bills` where `bills`.`id` = '3' limit 1