app/Http/Controllers/Admin/BookingController.php

    public function syncRequest2($request, Booking $booking)
    {
        $booking->request = $request->input('request');
        $booking->date_start = $request->input('date_start');
        $booking->date_end = $request->input('date_end');
        $booking->room_id = $request->input('room_id');
        $booking->total_room = $request->input('total_room');
        $booking->total_deposits = $request->input('total_deposits');
        $booking->deposits = $request->input('deposits');
        $booking->total_price = $request->input('total_price');
        $booking->paid = $request->input('paid');
        $booking->admin_id = Auth::user()->id;
        $booking->save();

//        revert booked in room
        $current_booking = $this->booking->find($booking->id);
        $current_booking->services()->sync($request->input('services'));

        $room = $current_booking->room()->find($booking->room_id);
//        if ($booking->paid == 0) {
//            $room->booked = 1;
//        } else {
//            $room->booked = 0;
//        }
        $room->save();
---
update `bookings` set `paid` = '1', `bookings`.`updated_at` = '2023-06-18 10:15:22' where `id` = 10