app/Http/Controllers/Admin/BookingController.php

select * from `bookings` where `active` = 1
---
    public function index()
    {

        $bookings = $this->booking->where('active', 1)->get();

select * from `bookings` where `active` = 1
---
    public function roomBooked()
    {
        $bookings = $this->booking->where('active', 1)->get();

select * from `rooms` where `rooms`.`id` = '1' limit 1
---
    public function customerBooked($id)
    {

        $room = $this->room->find($id);
        $customers = $room->customer()->get();

select * from `rooms` where `rooms`.`id` = 3 limit 1
---
    public function addBookingFromDeposits($id){
        $deposits = $this->deposits->find($id);
        $room = $this->room->where('id',$deposits->room_id)->first();

select * from `bookings` where `bookings`.`id` = '13' limit 1
select * from `bookings` where `bookings`.`id` = '7' limit 1
select * from `customers` where `customers`.`id` = 15 and `customers`.`id` = 15 limit 1
select * from `rooms` where `is_enabled` = 1 and `booked` = 0
select * from `services` where `is_enabled` = 1
---
    public function edit($id)
    {
        $booking = $this->booking->find($id);
        $customer = $booking->customer()->find($booking->customer_id);
        $current_room = $booking->room;
        $rooms = $this->room->where('is_enabled', 1)->where('booked', 0)->get();
        $services = $this->service->where('is_enabled', 1)->get();

select * from `bookings` where `bookings`.`id` = '10' limit 1
---
    public function update(ReBookingRequest $request, $id)
    {
        DB::beginTransaction();
        try {
            $booking = $this->booking->find($id);

select * from `bookings` where `bookings`.`id` = 10 limit 1
insert into `booking_service` (`booking_id`, `service_id`) values (10, 1)
select * from `rooms` where `rooms`.`id` = 6 and `rooms`.`id` = '6' limit 1
---


        // revert booked in room
        $current_booking = $this->booking->find($booking->id);
        $current_booking->services()->sync($request->input('services'));

        // update booked phòng
        $room = $current_booking->room()->find($booking->room_id);