app/Http/Controllers/Admin/BookingController.php

    public function customerBooked($id)
    {
        $room = $this->room->find($id);
        $activeBooking = $room->booking->where('active',1)->pluck('customer_id')->toArray();
        $customers = Customer::whereIn('id',$activeBooking)->get();
---
select * from `bookings` where `bookings`.`room_id` = 1 and `bookings`.`room_id` is not null limit 1

    public function addBookingFromDeposits($id){
        $deposits = $this->deposits->find($id);
        $room = $this->room->where('id',$deposits->room_id)->first();
---
select * from `rooms` where `rooms`.`id` = 6 limit 1