app/Http/Controllers/Admin/CustomerController.php

    public function index()
    {
        $customers = $this->customer->search()->orderBy('room_id','asc')->get();
---
select * from `customers` order by `room_id` asc

    public function destroy($id)
    {
        $customer = $this->customer->find($id);
        if ($customer->bookings()->exists()) {
            toastr()->error('Khách hàng đang có hợp đồng. Không thể xoá!');
        } else {
            $customer->delete();
---
select * from `customers` where `customers`.`id` = '37' limit 1
select exists(select * from `bookings` where `bookings`.`customer_id` = 37 and `bookings`.`customer_id` is not null) as `exists`
delete from `customers` where `id` = 37