app/Http/Controllers/Admin/DepositsController.php

    public function index()
    {
        if (Auth::user()->role==1){
            return redirect()->route('dashboard');
        }
        $depositses = $this->deposits->all();
---
select * from `deposits`

    public function create()
    {
        if (Auth::user()->role==1){
            return redirect()->route('dashboard');
        }

        $checkEmptyRoom = $this->room->checkEmptyRoom();
        if(!$checkEmptyRoom){
            toastr()->error(trans('Đã hết Căn hộ trống'));
            return back();
        }
        $rooms = $this->room->where('is_enabled', 1)->where('booked', 0)->get();
---
select * from `rooms` where `is_enabled` = 1 and `booked` = 0