app/Http/Controllers/Admin/EmployeeController.php

    public function index()
    {
        $employees = $this->employee->search()->get();
---
select * from `employees`

    public function changeStatus(Request $request){
        $commission = EmployeesComission::find($request->id);
---
select * from `employees_comission` where `employees_comission`.`id` = '1' limit 1