app/Http/Controllers/Admin/RoomController.php

    public function index()
    {
        $rooms = $this->room->all();
        $readyRooms = $this->room->where('is_enabled', 1)->where('booked', 0)->get();
        $bookedRooms = $this->room->where('is_enabled', 1)->where('booked', 1)->get();
---
select * from `rooms`
select * from `rooms` where `is_enabled` = 1 and `booked` = 0
select * from `rooms` where `is_enabled` = 1 and `booked` = 1

    public function edit($id)
    {
        $room = $this->room->find($id);
        $types = $this->type->all();
---
select * from `rooms` where `rooms`.`id` = '1' limit 1
select * from `types`