app/Http/Controllers/Admin/ServiceController.php

select * from `services`
---
    public function index()
    {
        $services = $this->service->all();

select * from `services` where `services`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $service = $this->service->find($id);